test/wrk_test_results.log
Performance Test Results
=========================
---------------------------------------
Testing with 20 threads and 1000 connections...
Running 5s test @ http://127.0.0.1:8080/19999
  20 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  0 requests in 5.06s, 0.00B read
  Socket errors: connect 0, read 3257, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B
---------------------------------------
---------------------------------------
Testing with 20 threads and 1100 connections...
Running 5s test @ http://127.0.0.1:8080/19999
  20 threads and 1100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  0 requests in 5.07s, 0.00B read
  Socket errors: connect 0, read 4112, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B
---------------------------------------
---------------------------------------
Testing with 20 threads and 1200 connections...
Running 5s test @ http://127.0.0.1:8080/19999
  20 threads and 1200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  0 requests in 5.07s, 0.00B read
  Socket errors: connect 0, read 66614, write 97, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B
---------------------------------------
---------------------------------------
Testing with 20 threads and 1300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 1900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 2900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 3900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 4900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 5900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 6900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 7900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 8900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9100 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9200 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9300 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9400 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9500 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9600 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9700 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9800 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 9900 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------
---------------------------------------
Testing with 20 threads and 10000 connections...
unable to connect to 127.0.0.1:8080 Connection refused
---------------------------------------